---
kind: other
id: Properties.T:Autodesk.Revit.DB.DirectContext3D.IndexBuffer
source: html/3bcafe0b-dccb-5656-8d8a-6d80bad15f55.htm
---
# IndexBuffer Properties

Specifies whether the .NET object represents a valid Revit entity.